# Pandas

In [ ]:
#Pandas is a Python library used for data analysis and data manipulation

In [5]:

data={"Name":['Sneha','Saranya','Sailu','Neha'],"Age":[20,30,40,50]}
print(data)

{'Name': ['Sneha', 'Saranya', 'Sailu', 'Neha'], 'Age': [20, 30, 40, 50]}

In [5]:
import pandas as pd

# Creating series

In [80]:
data={'A':100,'B':200,'C':'300'}
series=pd.Series(data)
print(series)

A    100
B    200
C    300
dtype: object

In [3]:
#Saclar
series=pd.Series(6,index=['sneha','banu','sonu','Samvidh','Abhilash','janu'])
print(series)

sneha       6
banu        6
sonu        6
Samvidh     6
Abhilash    6
janu        6
dtype: int64

# Slicing and Indexing

In [ ]:
#Indexing means accessing the elements using their index
#Slicing allows you to get a subset of series

In [10]:
series=pd.Series([11,22,33],index=['a','b','c'])
print(series['a'])
print(series['a':'c'])

11
a    11
b    22
c    33
dtype: int64

In [34]:
import pandas as pd
data = {'Name': 'Sneha', 'City': 'Nellore', 'Gender': 'Female'}
print(data)
S=pd.DataFrame([data])
print(S)

{'Name': 'Sneha', 'City': 'Nellore', 'Gender': 'Female'}
    Name     City  Gender
0  Sneha  Nellore  Female

In [33]:
import pandas as pd
data={'Name':['Sneha','Giri','Janu'],'city':['Nellore','Anantapur','Vijayawada'],'Gender':['female','male','female']}
print(data)
S=pd.DataFrame(data)
print(S)
P=pd.Series(index=['NULL'])
P

{'Name': ['Sneha', 'Giri', 'Janu'], 'city': ['Nellore', 'Anantapur', 'Vijayawada'], 'Gender': ['female', 'male', 'female']}
    Name        city  Gender
0  Sneha     Nellore  female
1   Giri   Anantapur    male
2   Janu  Vijayawada  female

NULL   NaN
dtype: float64

In [22]:
D=pd.Series(data)
print(D['Name'][1])

Giri

In [43]:
#Booleanindexing
import pandas as pd
series=pd.Series([11,22,33],index=['a','b','c'])
print(series)
print(series[series>11])

a    11
b    22
c    33
dtype: int64
b    22
c    33
dtype: int64

# LOC & ILOC

In [ ]:
#loc is label based
#Iloc is integer based

In [48]:
#loc
series=pd.Series([11,22,33],index=['a','b','c'])
print(series.loc['b'])
print(series.loc['c'])
print(series.loc['a'])

22
33
11

In [59]:
print(series.iloc[0])
print(series.iloc[1])
print(series.iloc[2])

11
22
33

In [50]:
K=pd.Series([100,200,300,400,600,600,800])
print(K)

0    100
1    200
2    300
3    400
4    600
5    600
6    800
dtype: int64

In [62]:
K.iloc[5]
K.iloc[5]+K.iloc[2]+K.iloc[6]

1700

In [63]:
K.iloc[-1]

800

# Manipulating Series

In [64]:
#adding value to series
series['d']=66
print(series)

a    11
b    22
c    33
d    66
dtype: int64

In [65]:
#udate value in series
series['a']=99
series

a    99
b    22
c    33
d    66
dtype: int64

In [69]:
#delete value in series
series=series.drop('b')
print(series)

a    99
c    33
d    66
dtype: int64

# Data Frame

In [ ]:
#Data frame is like a table with rows and coloumns
#used for data manipulation

# Creating data frame in many ways

In [76]:
#USING DICTIONARY
import pandas as pd
V={
    'Name':['Sneha','Rakshi','Harshini'],
    'City':['Hyderabad','Vijayawada','Warangal']
}
df=pd.DataFrame(V)
print(df)

       Name        City
0     Sneha   Hyderabad
1    Rakshi  Vijayawada
2  Harshini    Warangal

In [78]:
#From a list of lists
data=[['Raja',30,'HYD'],['Rani',50,'Banglore'],['Sita',32,'Tadepalli'],['Ram',25,'Rajolu']]
df=pd.DataFrame(data)
print(df)

      0   1          2
0  Raja  30        HYD
1  Rani  50   Banglore
2  Sita  32  Tadepalli
3   Ram  25     Rajolu

In [83]:
data=[['Raja',30,'Hyderabad'],['Rani',50,'Banglore'],['Sita',32,'Tadepalli'],['Ram',25,'Rajolu']]
df=pd.DataFrame(data,columns=['Name','Age','city'])
df

   Name  Age       city
0  Raja   30  Hyderabad
1  Rani   50   Banglore
2  Sita   32  Tadepalli
3   Ram   25     Rajolu

# Slicing and Indexing a data frame

In [81]:

df

   Name  Age       city
0  Raja   30        HYD
1  Rani   50   Banglore
2  Sita   32  Tadepalli
3   Ram   25     Rajolu

In [82]:
df['city']

0          HYD
1     Banglore
2    Tadepalli
3       Rajolu
Name: city, dtype: object

In [90]:
#boolean indexing
data=[['Raja',30,'Hyderabad'],['Rani',50,'Banglore'],['Sita',32,'Tadepalli'],['Ram',25,'Rajolu']]
df=pd.DataFrame(data,columns=['Name','Age','city'])
df
df[df['Age']>30]

   Name  Age       city
1  Rani   50   Banglore
2  Sita   32  Tadepalli

In [99]:
df

   Name  Age       city
0  Raja   30  Hyderabad
1  Rani   50   Banglore
2  Sita   32  Tadepalli
3   Ram   25     Rajolu

In [96]:
#using LOC ILOC
#loc:we should give lables
df.loc[0:2,['Name','city']]

   Name       city
0  Raja  Hyderabad
1  Rani   Banglore
2  Sita  Tadepalli

In [98]:
#iloc:we should give integer values
df.iloc[0:2,[1,2]]

   Age       city
0   30  Hyderabad
1   50   Banglore

# Manipulating Rows and Columns

In [100]:
#Adding columns
df['Salary']=[20000,30000,40000,90000]
df

   Name  Age       city  Salary
0  Raja   30  Hyderabad   20000
1  Rani   50   Banglore   30000
2  Sita   32  Tadepalli   40000
3   Ram   25     Rajolu   90000

In [102]:
#Updating dataframe
df.loc[df['Name']=='Raja','Salary']=85000
df

   Name  Age       city  Salary
0  Raja   30  Hyderabad   85000
1  Rani   50   Banglore   30000
2  Sita   32  Tadepalli   40000
3   Ram   25     Rajolu   90000

In [104]:
#deleting 
df.drop('Salary',axis=1,inplace=True)
df

   Name  Age       city
0  Raja   30  Hyderabad
1  Rani   50   Banglore
2  Sita   32  Tadepalli
3   Ram   25     Rajolu

In [ ]:
ID Name   Age City
1  Alisha 25  Delhi
2  Hannah 30  Mumbai
3  Alisha 25  Delhi
4  Steffy 35  Kolkatta